<template>
  <div class="sb">
    <lookfor :lookforList="sb"></lookfor>
  </div>
</template>

<script>
  import Lookfor from '../lookfor/lookfor'

  export default {
    data() {
      return {
        sb: {
          type: 'sb',
          list: [{
              name: '李四',
              endTime: '2018年1月1号',
              disc: '找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝'
            },
            {
              name: '李四',
              endTime: '2018年1月1号',
              disc: '找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝'
            },
            {
              name: '李四',
              endTime: '2018年1月1号',
              disc: '找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝'
            },
            {
              name: '李四',
              endTime: '2018年1月1号',
              disc: '找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝'
            },
            {
              name: '李四',
              endTime: '2018年1月1号',
              disc: '找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝'
            },
            {
              name: '李四',
              endTime: '2018年1月1号',
              disc: '找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝'
            }, {
              name: '李四',
              endTime: '2018年1月1号',
              disc: '找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝找海绵宝宝'
            }
          ]
        },
      }
    },
    components: {
      Lookfor
    }
  }

</script>

<style lang="stylus" scoped>


</style>
