<template>
  <div class="sth">
    <lookfor :lookforList="sth"></lookfor>
  </div>
</template>

<script>
  import Lookfor from '../lookfor/lookfor'

  export default {
    data() {
      return {
        sth: {
          type: 'sth',
          list: [{
              name: '赵四',
              endTime: '2018年1月1号',
              disc: '找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子'
            },
            {
              name: '赵四',
              endTime: '2018年1月1号',
              disc: '找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子'
            },
            {
              name: '赵四',
              endTime: '2018年1月1号',
              disc: '找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子'
            },
            {
              name: '赵四',
              endTime: '2018年1月1号',
              disc: '找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子'
            },
            {
              name: '赵四',
              endTime: '2018年1月1号',
              disc: '找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子'
            },
            {
              name: '赵四',
              endTime: '2018年1月1号',
              disc: '找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子'
            }, {
              name: '赵四',
              endTime: '2018年1月1号',
              disc: '找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子找派大星的裤子'
            }
          ]
        },
      }
    },
    components: {
      Lookfor
    }
  }

</script>

<style lang="stylus" scoped>


</style>
